# Python library data sets

In [3]:
from IPython.display import display

In [4]:
def glimpse(df):
    print(f"{df.shape[0]} rows and {df.shape[1]} columns")
    display(df.head())
    display(df.tail())

In [5]:
from pydataset import data

In [6]:
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [7]:
df = data('iris')
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa
4           4.6          3.1           1.5          0.2  setosa
5           5.0          3.6           1.4          0.2  setosa

In [8]:
df.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
146           6.7          3.0           5.2          2.3  virginica
147           6.3          2.5           5.0          1.9  virginica
148           6.5          3.0           5.2          2.0  virginica
149           6.2          3.4           5.4          2.3  virginica
150           5.9          3.0           5.1          1.8  virginica

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
import seaborn as sns

In [11]:
print(sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'taxis', 'tips', 'titanic']

In [12]:
df_geyser = sns.load_dataset('geyser')
df_geyser.head()

   duration  waiting   kind
0     3.600       79   long
1     1.800       54  short
2     3.333       74   long
3     2.283       62  short
4     4.533       85   long

In [13]:
df_geyser.shape

(272, 3)

In [14]:
from sklearn.datasets import fetch_california_housing

In [16]:
housing = fetch_california_housing(as_frame=True)
type(housing)

sklearn.utils._bunch.Bunch

In [17]:
df = housing['data'].join(housing['target'])
glimpse(df)

20640 rows and 9 columns

   MedInc  HouseAge  AveRooms  ...  Latitude  Longitude  MedHouseVal
0  8.3252      41.0  6.984127  ...     37.88    -122.23        4.526
1  8.3014      21.0  6.238137  ...     37.86    -122.22        3.585
2  7.2574      52.0  8.288136  ...     37.85    -122.24        3.521
3  5.6431      52.0  5.817352  ...     37.85    -122.25        3.413
4  3.8462      52.0  6.281853  ...     37.85    -122.25        3.422

[5 rows x 9 columns]

       MedInc  HouseAge  AveRooms  ...  Latitude  Longitude  MedHouseVal
20635  1.5603      25.0  5.045455  ...     39.48    -121.09        0.781
20636  2.5568      18.0  6.114035  ...     39.49    -121.21        0.771
20637  1.7000      17.0  5.205543  ...     39.43    -121.22        0.923
20638  1.8672      18.0  5.329513  ...     39.43    -121.32        0.847
20639  2.3886      16.0  5.254717  ...     39.37    -121.24        0.894

[5 rows x 9 columns]

In [18]:
from sklearn.datasets import load_iris

In [19]:
iris = load_iris()

In [21]:
import pandas as pd

In [23]:
x = pd.DataFrame(iris['data'], columns=iris['feature_names'])
y = pd.DataFrame(iris['target'], columns=['target'])
df = x.join(y)

In [24]:
df['target'].replace(dict(enumerate(iris['target_names'])), 
                     inplace=True)
glimpse(df)

150 rows and 5 columns

   sepal length (cm)  sepal width (cm)  ...  petal width (cm)  target
0                5.1               3.5  ...               0.2  setosa
1                4.9               3.0  ...               0.2  setosa
2                4.7               3.2  ...               0.2  setosa
3                4.6               3.1  ...               0.2  setosa
4                5.0               3.6  ...               0.2  setosa

[5 rows x 5 columns]

     sepal length (cm)  sepal width (cm)  ...  petal width (cm)     target
145                6.7               3.0  ...               2.3  virginica
146                6.3               2.5  ...               1.9  virginica
147                6.5               3.0  ...               2.0  virginica
148                6.2               3.4  ...               2.3  virginica
149                5.9               3.0  ...               1.8  virginica

[5 rows x 5 columns]

In [25]:
type(df)

pandas.core.frame.DataFrame

In [27]:
import nltk

In [28]:
nltk.download('movie_reviews')

[nltk_data] Downloading package movie_reviews to
[nltk_data]     /home/sofia/nltk_data...
[nltk_data]   Unzipping corpora/movie_reviews.zip.

True

In [29]:
from nltk.corpus import movie_reviews

In [30]:
documents = []

In [31]:
for fileid in movie_reviews.fileids():
    tag, filename = fileid.split('/')
    documents.append((tag, movie_reviews.raw(fileid)))
df = pd.DataFrame(documents, columns=['target', 'document'])
glimpse(df)

2000 rows and 2 columns

  target                                                                                   document
0    neg  plot : two teen couples go to a church party , drink and then drive . \nthey get into ...
1    neg  the happy bastard's quick movie review \ndamn that y2k bug . \nit's got a head start i...
2    neg  it is movies like these that make a jaded movie viewer thankful for the invention of t...
3    neg   " quest for camelot " is warner bros . ' first feature-length , fully-animated attemp...
4    neg  synopsis : a mentally unstable man undergoing psychotherapy saves a boy from a potenti...

     target                                                                                   document
1995    pos  wow ! what a movie . \nit's everything a movie can be : funny , dramatic , interesting...
1996    pos  richard gere can be a commanding actor , but he's not always in great films . \neveryt...
1997    pos  glory--starring matthew broderick , denzel washington , and morgan freeman--is the tru...
1998    pos  steven spielberg's second epic film on world war ii is an unquestioned masterpiece of ...
1999    pos  truman ( " true-man " ) burbank is the perfect name for jim carrey's character in this...